Конфигурация/DataProcessors/КопированиеНастроекСчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>КопированиеНастроекСчетаДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправленияКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправленияОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВзятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ПереопределениеКлассификацииУчетныхАктивовЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПереопределениеКлассификацииУчетныхАктивовЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныйУчетныйАктивЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйУчетныйАктивЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыУчастниковАнкет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчастниковАнкет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Представитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгодоприобретатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БенефициарныйВладелец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БенефициарныйВладелецУстановленныйКомпанией</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Оповещения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкиПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьСписокПолучателейИзИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСравнений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокЗначений</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/DataProcessors/КопированиеНастроекСчетаДоверительногоУправления/Ext/ObjectModule.bsl
#Область ПереносБЭКОфис
Процедура ПереносНастроекБЭК(ДокументОтчет, КопируемыеРегистры, Параметры, Отказ) Экспорт
		
	Расшифровка = Новый Структура;
	ДокументОтчет.Очистить();
	
	КопируемыеНастройки = Новый Соответствие;
	
	Для Каждого РегистрНастроек Из КопируемыеРегистры Цикл
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	#РегистрНастроек КАК РегистрНастроек
		|ГДЕ
		|	&ФильтрЗаписей");
		
		ПолеПриемника = ПолучитьПолеПриемникаРегистраНастроек(РегистрНастроек.Значение);
		
		Если Метаданные.РегистрыСведений[РегистрНастроек.Значение].ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#РегистрНастроек",
			СтрШаблон("РегистрСведений.%1", РегистрНастроек.Значение));
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрЗаписей",
			СтрШаблон("(%1 = &СчетДоверительногоУправления)", ПолеПриемника));
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#РегистрНастроек",
			СтрШаблон("РегистрСведений.%1.СрезПоследних(&ДатаНастроек, %2 = &СчетДоверительногоУправления)",
			РегистрНастроек.Значение,
			ПолеПриемника));
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрЗаписей", "ИСТИНА");
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНастроек",					ЭтотОбъект.ДатаВзятия);	
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправленияОткуда);	
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		КопируемыеНастройки.Вставить(РегистрНастроек.Значение, ВыборкаЗапроса);
		
	КонецЦикла;  
	
	//контактные лица и банковские счета
	Если Параметры.КонтактныеЛицаИзАнкет Тогда  
		ВыборкаЗапроса  = ПолучитьКонтактныеЛицаИзАнкеты();  
		КопируемыеНастройки.Вставить("КонтактныеЛица", ВыборкаЗапроса);
	КонецЕсли;

	Если Параметры.БанковскиеСчетаИзАнкет Тогда
		ВыборкаЗапроса = ПолучитьБанковскиеСчетаИзАнкеты();
		КопируемыеНастройки.Вставить("БанковскиеСчета", ВыборкаЗапроса);
	КонецЕсли;
	
	
	// Добавляем их в приемники		
	// обернем в транзакцию  
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	ОрганизацияПриемника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправленияКуда, "Организация");
	
	Для Каждого РегистрНастроек Из КопируемыеРегистры Цикл
		Если Не Отказ Тогда
			СкопироватьДанныеРегистра(ОрганизацияПриемника, РегистрНастроек.Значение, КопируемыеНастройки, Расшифровка, Отказ, Параметры.ПодтверждениеПереноса);
			Если Отказ Тогда 
				ОтменитьТранзакцию(); 
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;    
	
	Если Параметры.КонтактныеЛицаИзАнкет И НЕ Отказ Тогда   
		СкопироватьДанныеРегистра(ОрганизацияПриемника, "КонтактныеЛица", КопируемыеНастройки, Расшифровка, Отказ, Параметры.ПодтверждениеПереноса);
		Если Отказ Тогда 
			ОтменитьТранзакцию();
		КонецЕсли; 
	КонецЕсли;
	
	Если Параметры.БанковскиеСчетаИзАнкет И НЕ Отказ Тогда   
		СкопироватьДанныеРегистра(ОрганизацияПриемника, "БанковскиеСчета", КопируемыеНастройки, Расшифровка, Отказ, Параметры.ПодтверждениеПереноса);
		Если Отказ Тогда 
			ОтменитьТранзакцию();
		КонецЕсли; 
	КонецЕсли;
	
	Если Не Отказ Тогда 
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Если Расшифровка <> Неопределено Тогда
		СформироватьОтчетОПроделанныхОперациях(ДокументОтчет, Расшифровка);  
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПолеПриемникаРегистраНастроек(ИмяРегистра)

	Если ИмяРегистра = "НастройкиРасчетаБенчмарков"
		Или ИмяРегистра = "НастройкиРасчетаПлановойДоходности"	Тогда
		
		ПолеПриемника = "СубъектАналитики";	
		
	ИначеЕсли ИмяРегистра = "НастройкиРасчетаРыночнойСтавкиПоВидамАктивов"
		Или ИмяРегистра = "СоставИНастройкиОтчетов"	Тогда
		
		ПолеПриемника = "Субъект";	
		
	ИначеЕсли ИмяРегистра = "ЗначенияДополнительныхСведений" ИЛИ ИмяРегистра = "КонтактныеЛица" Тогда
		
		ПолеПриемника = "Объект"; 
		
	ИначеЕсли ИмяРегистра = "ПереопределениеКлассификацииУчетныхАктивовЦБ" Тогда 
		
		ПолеПриемника = "Клиент";
		
	Иначе
		
		ПолеПриемника = "СчетДоверительногоУправления";
		
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений[ИмяРегистра].Измерения.Найти(ПолеПриемника) = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Регистр сведений ""%1"" не содержит измерения ""%2""", ИмяРегистра, ПолеПриемника);	
	КонецЕсли;
	
	Возврат ПолеПриемника;	
	
КонецФункции

Функция ИсключаемыеИзКопированияСвойстваРегистраНастроек(ИмяРегистра)
	
	Если ИмяРегистра = "НастройкиРасчетаВознагражденияУправляющего" Тогда
		ИсключаемыеСвойства = "Основание";	
	Иначе	
		ИсключаемыеСвойства = Неопределено;
	КонецЕсли;
	
	Возврат ИсключаемыеСвойства;	
	
КонецФункции

Функция ПолучитьКонтактныеЛицаИзАнкеты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АнкетаЮридическогоЛица.Ссылка КАК Анкета
		|ПОМЕСТИТЬ _Анкета
		|ИЗ
		|	Документ.АнкетаЮридическогоЛица КАК АнкетаЮридическогоЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО АнкетаЮридическогоЛица.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|ГДЕ
		|	АнкетаЮридическогоЛица.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(АнкетаЮридическогоЛица.Дата, ДЕНЬ) <= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	АнкетаЮридическогоЛица.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.Языки.Русский) КАК Язык,
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка.ЮрФизЛицо КАК Объект,
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо КАК КонтактноеЛицо,
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Должность КАК Должность,
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ОснованиеПолномочий КАК ОснованиеПолномочий,
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.АнкетаЮридическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели
		|ГДЕ
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка В
		|			(ВЫБРАТЬ
		|				_Анкета.Анкета
		|			ИЗ
		|				_Анкета КАК _Анкета)
		|	И АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ВидУчастника = ЗНАЧЕНИЕ(Перечисление.ВидыУчастниковАнкет.Представитель)";
	
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправленияКуда); 
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаУстановки); 
	
	// нужна проверка что есть анкета и берем нужную анкету. уточнить условие
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьБанковскиеСчетаИзАнкеты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АнкетаЮридическогоЛица.Ссылка КАК Анкета
		|ПОМЕСТИТЬ _Анкета
		|ИЗ
		|	Документ.АнкетаЮридическогоЛица КАК АнкетаЮридическогоЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправленияКуда) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО АнкетаЮридическогоЛица.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|ГДЕ
		|	АнкетаЮридическогоЛица.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(АнкетаЮридическогоЛица.Дата, ДЕНЬ) <= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	АнкетаЮридическогоЛица.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БанковскиеРеквизиты.РасчетныйСчет КАК РасчетныйСчет
		|ИЗ
		|	Документ.АнкетаЮридическогоЛица.БанковскиеРеквизиты КАК БанковскиеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления.РасчетныеСчета КАК СчетаДоверительногоУправленияРасчетныеСчета
		|		ПО (СчетаДоверительногоУправленияРасчетныеСчета.Ссылка = &СчетДоверительногоУправленияКуда)
		|			И (СчетаДоверительногоУправленияРасчетныеСчета.РасчетныйСчет = БанковскиеРеквизиты.РасчетныйСчет)
		|ГДЕ
		|	БанковскиеРеквизиты.Ссылка В
		|			(ВЫБРАТЬ
		|				_Анкета.Анкета
		|			ИЗ
		|				_Анкета КАК _Анкета)
		|	И НЕ СчетаДоверительногоУправленияРасчетныеСчета.РасчетныйСчет ЕСТЬ NULL";
	
	Если ЭтотОбъект.СчетДоверительногоУправленияКуда.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица 
		ИЛИ ЭтотОбъект.СчетДоверительногоУправленияКуда.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "АнкетаЮридическогоЛица", "АнкетаФизическогоЛица");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаУстановки);   
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияКуда", ЭтотОбъект.СчетДоверительногоУправленияКуда); 

	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

&НаСервере
Процедура СкопироватьДанныеРегистра(ОрганизацияПриемника, ИмяРегистра, КопируемыеНастройки, Расшифровка, Отказ, ПодтверждениеПереноса)
	
	Если ИмяРегистра = "БанковскиеСчета" Тогда
		// это не регистр. пишем данные в табличную часть справочника СчетаДоверительногоУправления
		
		СвойстваПриемника = Новый Структура;
		СвойстваПриемника.Вставить("Период",		ЭтотОбъект.ДатаУстановки);
		СвойстваПриемника.Вставить("Организация",	ОрганизацияПриемника); 
		СвойстваПриемника.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправленияКуда);
		
		ВыборкаНастроек = КопируемыеНастройки[ИмяРегистра];
		ВыборкаНастроек.Сбросить();
		
		Пока ВыборкаНастроек.Следующий() Цикл
			
			//ОшибкаКопирования	= Ложь;
			ТекстОшибки			= "";
			
			СчетДУОбъект = ЭтотОбъект.СчетДоверительногоУправленияКуда.ПолучитьОбъект();
			
			НоваяСтрока = СчетДУОбъект.РасчетныеСчета.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНастроек);

			Попытка  
				Если ПодтверждениеПереноса Тогда
					СчетДУОбъект.Записать();  
				КонецЕсли;
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Отказ = Истина;
			КонецПопытки;
			
			ДобавитьРасшифровкуОперации(Расшифровка, ЭтотОбъект.СчетДоверительногоУправленияКуда, ИмяРегистра, ВыборкаНастроек, СвойстваПриемника, "", Отказ, ТекстОшибки, ПодтверждениеПереноса)
			
		КонецЦикла;
		
	Иначе	
		
		ПолеПриемника = ПолучитьПолеПриемникаРегистраНастроек(ИмяРегистра);
		
		СвойстваПриемника = Новый Структура;
		СвойстваПриемника.Вставить("Период",		ЭтотОбъект.ДатаУстановки);
		СвойстваПриемника.Вставить("Организация",	ОрганизацияПриемника); 
		Если ИмяРегистра = "КонтактныеЛица" Тогда
			СвойстваПриемника.Вставить(ПолеПриемника, Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправленияКуда, ЭтотОбъект.ДатаУстановки));
		Иначе
			СвойстваПриемника.Вставить(ПолеПриемника,	ЭтотОбъект.СчетДоверительногоУправленияКуда);
		КонецЕсли;
		
		ИсключаяСвойства = ИсключаемыеИзКопированияСвойстваРегистраНастроек(ИмяРегистра);
		
		ВыборкаНастроек = КопируемыеНастройки[ИмяРегистра];
		ВыборкаНастроек.Сбросить();
		
		Пока ВыборкаНастроек.Следующий() Цикл
			
			//ОшибкаКопирования	= Ложь;
			ТекстОшибки			= "";
			
			НоваяНастройка = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(НоваяНастройка, ВыборкаНастроек, , ИсключаяСвойства);
			ЗаполнитьЗначенияСвойств(НоваяНастройка, СвойстваПриемника);
			
			Попытка
				Если ПодтверждениеПереноса Тогда
					НоваяНастройка.Записать(Ложь);  
				КонецЕсли;
			Исключение
				//ОшибкаКопирования = Истина;
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Отказ = Истина;
			КонецПопытки;
			
			ДобавитьРасшифровкуОперации(Расшифровка, ЭтотОбъект.СчетДоверительногоУправленияКуда, ИмяРегистра, ВыборкаНастроек, СвойстваПриемника, ИсключаяСвойства, Отказ, ТекстОшибки, ПодтверждениеПереноса);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти	 
	 
#Область ПереносБухгалтерия     

Процедура ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, ИмяРегистра, ФильтрПоВидуУчета)
	
	  НоваяСтрока = ТаблицаПравил.Добавить();
	  
	  НоваяСтрока.ИмяРегистра = ИмяРегистра;
	  НоваяСтрока.ФильтрПоВидуУчета = ФильтрПоВидуУчета;
	
КонецПроцедуры

Функция СоздатьТаблицуПравилПереноса(Параметры)
	
	ТаблицаПравил = Новый ТаблицаЗначений;
	ТаблицаПравил.Колонки.Добавить("ИмяРегистра");
	ТаблицаПравил.Колонки.Добавить("ФильтрПоВидуУчета");
	
	Если Параметры.Общие Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаОбщие", "");
	КонецЕсли;
	
	Если Параметры.ПоВидуЕПС Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиПоВидуУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	КонецЕсли;	
	Если Параметры.ПоВидуБУ Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиПоВидуУчета", Перечисления.ВидыУчета.БухгалтерскийУчет);
	КонецЕсли;	
	Если Параметры.ПоВидуНУ Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиПоВидуУчета", Перечисления.ВидыУчета.НалоговыйУчет);
	КонецЕсли;
	
	Если Параметры.Активы И Параметры.ПоВидуЕПС Тогда 
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаАктивовЕПС", "");
	КонецЕсли;
	Если Параметры.Активы И Параметры.ПоВидуБУ Тогда 
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаАктивов", Перечисления.ВидыУчета.БухгалтерскийУчет);
	КонецЕсли;
	Если Параметры.Активы И Параметры.ПоВидуНУ Тогда  
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаАктивов", Перечисления.ВидыУчета.НалоговыйУчет);
	КонецЕсли;
	
	Если Параметры.АктивыПоСрочности Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаАктивов", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	КонецЕсли;	
	
	Если Параметры.Комиссия И Параметры.ПоВидуЕПС  Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаКомиссии", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	КонецЕсли;
	Если Параметры.Комиссия И Параметры.ПоВидуБУ Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаКомиссии", Перечисления.ВидыУчета.БухгалтерскийУчет);
	КонецЕсли;
	Если Параметры.Комиссия И Параметры.ПоВидуНУ  Тогда 
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "НастройкиУчетаКомиссии", Перечисления.ВидыУчета.НалоговыйУчет);
	КонецЕсли;   
	
	Если Параметры.ПереопределениеКлассификации Тогда
		ДобавитьСтрокуВТаблицуПравил(ТаблицаПравил, "ПереопределениеКлассификацииУчетныхАктивовЦБ", "");
	КонецЕсли;	
	
	Возврат ТаблицаПравил;
	
КонецФункции	

Процедура ПереносНастроекБух(ДокументОтчет, Параметры, Отказ, АвтоматическийРежим, ТекстОшибки) Экспорт
	
	ОрганизацияПриемника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправленияКуда, "Организация");
	
	Расшифровка = Новый Структура;
	ДокументОтчет.Очистить();
	
	Если ПараметрыСеанса.ТекущаяОрганизация <> ЭтотОбъект.СчетДоверительногоУправленияКуда.Организация Тогда
	    ТекстОшибки = "Текущая организация должна быть равна организации счета-приёмника";
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаПравил = СоздатьТаблицуПравилПереноса(Параметры);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);         
	
	Для Каждого СтрокаПравил из ТаблицаПравил Цикл
		Если СтрокаПравил.ИмяРегистра = "ПереопределениеКлассификацииУчетныхАктивовЦБ" Тогда
			ПереносНастроекПоРегиструПереопределениеКлассификации(Отказ, Расшифровка, Параметры, АвтоматическийРежим, ТекстОшибки);
		Иначе
			ПереносНастроекПоРегистру(СтрокаПравил.ИмяРегистра, СтрокаПравил.ФильтрПоВидуУчета, Отказ, Расшифровка, Параметры.ПодтверждениеПереноса, АвтоматическийРежим, ТекстОшибки);
		КонецЕсли;	
		Если Отказ Тогда 
			ОтменитьТранзакцию();
			ТекстОшибки = ТекстОшибки + Символы.ПС + ОбщегоНазначения.ПолучитьТекстСообщенийПользователю(Символы.ПС, Истина);
			Если СтрокаПравил.ФильтрПоВидуУчета <> "" Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС + "Вид учета: " + СтрокаПравил.ФильтрПоВидуУчета;
			КонецЕсли;
			Возврат;
		КонецЕсли; 
	КонецЦикла;
		
	ЗафиксироватьТранзакцию(); 
	
	Если Расшифровка <> Неопределено И НЕ Отказ Тогда
		СформироватьОтчетОПроделанныхОперациях(ДокументОтчет, Расшифровка);  
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереносНастроекПоРегистру(ИмяРегистра, ФильтрПоВидуУчета = "", Отказ, Расшифровка, ПодтверждениеПереноса, АвтоматическийРежим, ТекстОшибки)
	
	СвойстваПриемника = Новый Структура;
	СвойстваПриемника.Вставить("Период",		ЭтотОбъект.ДатаУстановки);
	СвойстваПриемника.Вставить("Организация",	ЭтотОбъект.СчетДоверительногоУправленияКуда.Организация);
	СвойстваПриемника.Вставить("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправленияКуда); 
	
	
	ОчищатьСтарыеНастройки = Истина;
	
	ЗаписиПриемник = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	ЗаписиПриемник.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
	ЗаписиПриемник.Отбор.СчетДоверительногоУправления.Установить(ЭтотОбъект.СчетДоверительногоУправленияКуда); 
	
	Если ФильтрПоВидуУчета <> "" Тогда
		ЗаписиПриемник.Отбор.ВидУчета.Установить(ФильтрПоВидуУчета);
	КонецЕсли;
	
	Попытка
		ЗаписиПриемник.Прочитать();
	Исключение 
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки();
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если ОчищатьСтарыеНастройки Тогда
		ЗаписиПриемник.Очистить();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Настройки.*
		|ИЗ
		|	РегистрСведений.%ИмяРегистра%.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК Настройки"; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяРегистра%", ИмяРегистра);
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаВзятия);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправленияОткуда);
	
	Если ФильтрПоВидуУчета <> "" Тогда
		Запрос.УстановитьПараметр("ВидУчета", ФильтрПоВидуУчета);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период,", "&Период, ВидУчета = &ВидУчета И");
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		СтрокаЗаписиПриемник = ЗаписиПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаписиПриемник, ВыборкаДетальныеЗаписи);
		СтрокаЗаписиПриемник.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправленияКуда;
		СтрокаЗаписиПриемник.Организация = ЭтотОбъект.СчетДоверительногоУправленияКуда.Организация;
		Если ФильтрПоВидуУчета <> "" Тогда
			СтрокаЗаписиПриемник.ВидУчета = ФильтрПоВидуУчета;
		КонецЕсли;
		СтрокаЗаписиПриемник.Период = ЭтотОбъект.ДатаУстановки;  
		
		Если ИмяРегистра = "НастройкиУчетаАктивов" И ЭтотОбъект.ДатаУстановки > Дата(2025, 1, 1) Тогда
			Если СтрокаЗаписиПриемник.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет 
				И СтрокаЗаписиПриемник.УчетныйАктив = Справочники.УчетныеАктивы.Паи 
				И СтрокаЗаписиПриемник.КлассификацияАктиваПоСрочности = Справочники.КлассификаторАктивовПоСрочности.СвышеГода Тогда
				СтрокаЗаписиПриемник.КлассификацияАктиваПоСрочности = Справочники.КлассификаторАктивовПоСрочности.СвышеПятиЛет; 
				ТекстСообщения = "Вид учета Единый бухгалтерский учет, вид актива Паи: Классификация актива по срочности 'Свыше года' заменена на 'Свыше пяти лет'";
				ДобавитьРасшифровкуОперации(Расшифровка, ЭтотОбъект.СчетДоверительногоУправленияКуда, ИмяРегистра, ВыборкаДетальныеЗаписи, СвойстваПриемника, , Истина, ТекстСообщения, ПодтверждениеПереноса);				
			КонецЕсли;
		КонецЕсли;

		ДобавитьРасшифровкуОперации(Расшифровка, ЭтотОбъект.СчетДоверительногоУправленияКуда, ИмяРегистра, ВыборкаДетальныеЗаписи, СвойстваПриемника, , Ложь, "", ПодтверждениеПереноса);
		
	КонецЦикла;
	
	Попытка
		Если ПодтверждениеПереноса Тогда
			Если АвтоматическийРежим Тогда
				УстановитьПривилегированныйРежим(Истина);
			КонецЕсли;
			ЗаписиПриемник.Записать();
			Если АвтоматическийРежим Тогда
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЕсли;
	Исключение 
		//
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки(); 
		Отказ = Истина;
		Возврат;
	КонецПопытки;   

КонецПроцедуры

Процедура ПереносНастроекПоРегиструПереопределениеКлассификации(Отказ, Расшифровка, Параметры, АвтоматическийРежим, ТекстОшибки)
	// версия процедуры  ПереносНастроекПоРегистру()
	// нет измерения Счет доверительного управления, есть измерение Клиент
	// не нужен фильтр на вид учета  
		
	СвойстваПриемника = Новый Структура;
	СвойстваПриемника.Вставить("Период",		ЭтотОбъект.ДатаУстановки);
	СвойстваПриемника.Вставить("Организация",	ЭтотОбъект.СчетДоверительногоУправленияКуда.Организация);
	СвойстваПриемника.Вставить("Клиент",		Параметры.КлиентКуда); 
		
	
	ОчищатьСтарыеНастройки = Истина;
	
	ЗаписиПриемник = РегистрыСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СоздатьНаборЗаписей();
	
	ЗаписиПриемник.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
	ЗаписиПриемник.Отбор.Клиент.Установить(Параметры.КлиентКуда);
	
	Попытка
		ЗаписиПриемник.Прочитать();
	Исключение 
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки();
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если ОчищатьСтарыеНастройки Тогда
		ЗаписиПриемник.Очистить();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Настройки.*
		|ИЗ
		|	РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&Период, Клиент = &Клиент И Организация = &Организация) КАК Настройки";
	
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаВзятия);
	Запрос.УстановитьПараметр("Клиент", Параметры.КлиентОткуда);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.СчетДоверительногоУправленияОткуда.Организация);
		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		СтрокаЗаписиПриемник = ЗаписиПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаписиПриемник, ВыборкаДетальныеЗаписи);
		СтрокаЗаписиПриемник.Клиент = Параметры.КлиентКуда;
		СтрокаЗаписиПриемник.Организация = ЭтотОбъект.СчетДоверительногоУправленияКуда.Организация;
		СтрокаЗаписиПриемник.Период = ЭтотОбъект.ДатаУстановки;   
		
		ДобавитьРасшифровкуОперации(Расшифровка, ЭтотОбъект.СчетДоверительногоУправленияКуда, "ПереопределениеКлассификацииУчетныхАктивовЦБ", ВыборкаДетальныеЗаписи, СвойстваПриемника, , Ложь, "", Параметры.ПодтверждениеПереноса);
		
	КонецЦикла;
	
	Попытка 
		Если Параметры.ПодтверждениеПереноса Тогда
			Если АвтоматическийРежим Тогда
				УстановитьПривилегированныйРежим(Истина);
			КонецЕсли;
			ЗаписиПриемник.Записать();
			Если АвтоматическийРежим Тогда
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЕсли;
	Исключение   
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки();
		Отказ = Истина;
		Возврат;
	КонецПопытки;
		
КонецПроцедуры	

Функция ПолучитьПараметрыПереносаНастроекБухПоУмолчанию() Экспорт
	
	Если НЕ (ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправленияОткуда) И ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправленияКуда)) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Источник.ВестиБухгалтерскийУчет
	|		И ЕСТЬNULL(Реципиент.ВестиБухгалтерскийУчет, ИСТИНА) КАК ВестиБухгалтерскийУчет,
	|	Источник.ВестиЕдиныйБухгалтерскийУчет
	|		И ЕСТЬNULL(Реципиент.ВестиЕдиныйБухгалтерскийУчет, ИСТИНА) КАК ВестиЕдиныйБухгалтерскийУчет,
	|	Источник.ВестиНалоговыйУчет
	|		И ЕСТЬNULL(Реципиент.ВестиНалоговыйУчет, ИСТИНА) КАК ВестиНалоговыйУчет,
	|	КлиентыДоверительногоУправленияОткуда.Клиент КАК КлиентОткуда,
	|	КлиентыДоверительногоУправленияКуда.Клиент КАК КлиентКуда
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет, ЛОЖЬ) КАК ВестиБухгалтерскийУчет,
	|		ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет, ЛОЖЬ) КАК ВестиЕдиныйБухгалтерскийУчет,
	|		ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет, ЛОЖЬ) КАК ВестиНалоговыйУчет
	|	ИЗ
	|		РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&ДатаВзятия, СчетДоверительногоУправления = &СчетОткуда) КАК НастройкиУчетаОбщиеСрезПоследних) КАК Источник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет, ЛОЖЬ) КАК ВестиБухгалтерскийУчет,
	|			ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет, ЛОЖЬ) КАК ВестиЕдиныйБухгалтерскийУчет,
	|			ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет, ЛОЖЬ) КАК ВестиНалоговыйУчет
	|		ИЗ
	|			РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&ДатаУстановки, СчетДоверительногоУправления = &СчетКуда) КАК НастройкиУчетаОбщиеСрезПоследних) КАК Реципиент
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВзятия, СчетДоверительногоУправления = &СчетОткуда) КАК КлиентыДоверительногоУправленияОткуда
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаУстановки, СчетДоверительногоУправления = &СчетКуда) КАК КлиентыДоверительногоУправленияКуда
	|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("ДатаВзятия", ЭтотОбъект.ДатаВзятия);
	Запрос.УстановитьПараметр("СчетОткуда", ЭтотОбъект.СчетДоверительногоУправленияОткуда);
	Запрос.УстановитьПараметр("ДатаУстановки", ЭтотОбъект.ДатаУстановки);
	Запрос.УстановитьПараметр("СчетКуда", ЭтотОбъект.СчетДоверительногоУправленияКуда);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		
		СписокПараметров = Новый Структура;
		
		СписокПараметров.Вставить("КлиентОткуда", Выборка.КлиентОткуда);
		СписокПараметров.Вставить("КлиентКуда", Выборка.КлиентКуда);

		ВестиБухгалтерскийУчет = Выборка.ВестиБухгалтерскийУчет;
		ВестиЕдиныйБухгалтерскийУчет = Выборка.ВестиЕдиныйБухгалтерскийУчет;
		ВестиНалоговыйУчет = Выборка.ВестиНалоговыйУчет;
		
		СписокПараметров.Вставить("ВестиБухгалтерскийУчет", ВестиБухгалтерскийУчет);
		СписокПараметров.Вставить("ВестиЕдиныйБухгалтерскийУчет", ВестиЕдиныйБухгалтерскийУчет);
		СписокПараметров.Вставить("ВестиНалоговыйУчет", ВестиНалоговыйУчет);
		
		ЭтоОдинКлиент = (Выборка.КлиентОткуда = Выборка.КлиентКуда);
		
		СписокПараметров.Вставить("Общие", Истина);
		
		ВидДоговораКуда	= ЭтотОбъект.СчетДоверительногоУправленияКуда.ВидДоговораДоверительногоУправления;
		Если ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
			ИЛИ ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР
			ИЛИ ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
			ИЛИ ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов Тогда
			СписокПараметров.Вставить("ПоВидуНУ", Ложь);
		Иначе
			СписокПараметров.Вставить("ПоВидуНУ", ВестиНалоговыйУчет);
		КонецЕсли;
		
		Если ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица
			ИЛИ ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда
			СписокПараметров.Вставить("ПоВидуБУ", Ложь);
			СписокПараметров.Вставить("ПоВидуЕПС", Ложь);
		Иначе
			СписокПараметров.Вставить("ПоВидуБУ", ВестиБухгалтерскийУчет);
			СписокПараметров.Вставить("ПоВидуЕПС", ВестиЕдиныйБухгалтерскийУчет);
		КонецЕсли;
		
		ВидДоговораОткуда = ЭтотОбъект.СчетДоверительногоУправленияОткуда.ВидДоговораДоверительногоУправления;
		Если ВидДоговораОткуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
			И ВидДоговораКуда <> ВидДоговораОткуда Тогда
			// в ПР или СС копируем настройки из ПН. В ПН могут быть старые некорретные настройки. Избежим возможного косяка
			СписокПараметров.ПоВидуНУ = Ложь;
		КонецЕсли;
		
		СписокПараметров.Вставить("Активы", ВестиЕдиныйБухгалтерскийУчет ИЛИ ВестиБухгалтерскийУчет ИЛИ ВестиНалоговыйУчет);
		СписокПараметров.Вставить("АктивыПоСрочности", ВестиЕдиныйБухгалтерскийУчет);
		СписокПараметров.Вставить("Комиссия", ВестиЕдиныйБухгалтерскийУчет ИЛИ ВестиБухгалтерскийУчет ИЛИ ВестиНалоговыйУчет);
		СписокПараметров.Вставить("ЗакрытияСчетов", ВестиЕдиныйБухгалтерскийУчет ИЛИ ВестиБухгалтерскийУчет ИЛИ ВестиНалоговыйУчет);
		
		Если ВестиЕдиныйБухгалтерскийУчет И Не ЭтоОдинКлиент Тогда 
			СписокПараметров.Вставить("ПереопределениеКлассификации", Истина);
		Иначе
			СписокПараметров.Вставить("ПереопределениеКлассификации", Ложь);
		КонецЕсли;
		
		Возврат СписокПараметров;
		
	КонецЕсли;	

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Расшифровка

&НаСервере
Функция НайтиРасшифровкуОперации(Операции, ИмяОперации)
	
	Для Каждого Операция Из Операции Цикл
		Если Операция.Имя = ИмяОперации Тогда
			Возврат Операция;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Неопределено
	
КонецФункции

Процедура ДобавитьРасшифровкуОперации(Расшифровка, Приемник, ИмяРегистра, НастройкиИсточника, СвойстваПриемника, ИсключаяСвойства, Ошибка, ТекстОшибки, ПодтверждениеПереноса)
	
	Если Не Расшифровка.Свойство("Операции") Тогда
		Расшифровка.Вставить("Операции", Новый Массив);
	КонецЕсли;	
	
	// Группа операций
	
	ИмяГруппыОпераций = ?(Ошибка, "Ошибки", ?(ПодтверждениеПереноса, "Скопированные настройки", "Предлагаемые к копированию настройки"));
	
	ГруппаОпераций = НайтиРасшифровкуОперации(Расшифровка.Операции, ИмяГруппыОпераций);
	Если ГруппаОпераций = Неопределено Тогда
		ГруппаОпераций = РаботаСДокументами.ДобавитьРасшифровкуОперации(Расшифровка, ИмяГруппыОпераций, , , Истина);	
	КонецЕсли;
		
	// Приемник
	
	ОперацияПриемника = НайтиРасшифровкуОперации(ГруппаОпераций.Операции, Приемник);
	Если ОперацияПриемника = Неопределено Тогда
		ОперацияПриемника = РаботаСДокументами.ДобавитьРасшифровкуОперации(ГруппаОпераций, Приемник, , , Истина);	
	КонецЕсли;
	
	// Регистр
	Если ИмяРегистра  = "БанковскиеСчета" Тогда
		СинонимРегистра = "Банковские счета"; 
	Иначе	
		СинонимРегистра = Метаданные.РегистрыСведений[ИмяРегистра].Синоним; 
	КонецЕсли;
	
	ОперацииРегистра = НайтиРасшифровкуОперации(ОперацияПриемника.Операции, СинонимРегистра);
	Если ОперацииРегистра = Неопределено Тогда
		
		ТаблицаНастроек = Новый ТаблицаЗначений;
		Для Каждого Колонка Из НастройкиИсточника.Владелец().Колонки Цикл
			ТаблицаНастроек.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);		
		КонецЦикла;
		Если Ошибка Тогда
			ТаблицаНастроек.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Строка"));	
		КонецЕсли;
		
		ОперацииРегистра = РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(ОперацияПриемника, СинонимРегистра, ТаблицаНастроек);	
		
	КонецЕсли;
	
	// Настройка
	
	ОперацияРегистра = ОперацииРегистра.Операции.Добавить();
	
	ЗаполнитьЗначенияСвойств(ОперацияРегистра, НастройкиИсточника, , ИсключаяСвойства);
	ЗаполнитьЗначенияСвойств(ОперацияРегистра, СвойстваПриемника);
	
	Если Ошибка Тогда
		ОперацияРегистра.Ошибка = ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОтчетОПроделанныхОперациях(ДокументОтчет, Расшифровка)
	
	// Если есть ошибки, то их отобразим в начале
	
	Если Расшифровка.Свойство("Операции") И Расшифровка.Операции.Количество() > 1 Тогда
		РасшифровкаОшибок = НайтиРасшифровкуОперации(Расшифровка.Операции, "Ошибки");
		Если РасшифровкаОшибок <> Неопределено Тогда
			Расшифровка.Операции.Удалить(Расшифровка.Операции.Найти(РасшифровкаОшибок));
			Расшифровка.Операции.Вставить(0, РасшифровкаОшибок);	
		КонецЕсли;
	КонецЕсли;	
	
	// Формируем табличный документ
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();
	ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
	
	Если Расшифровка.Свойство("Операции") Тогда 
		РаботаСДокументами.СформироватьРасшифровкуОперации(Расшифровка, ПараметрыВывода);
	КонецЕсли;
	
	// Разворачиваем строки до нужного уровня
	ПараметрыВывода.ДокументРезультат.ПоказатьУровеньГруппировокСтрок(3);

	ДокументОтчет = ПараметрыВывода.ДокументРезультат;
	
КонецПроцедуры    

#КонецОбласти

#Область Оповещение

&НаСервере
Функция СформироватьОтчетОНастройкахПереносаHtml(НастройкиПереноса, АвтоматическийРежим, ТекстОшибки) 
	
	ОтчетОНастройкахПереноса = "<html><body>";       
	
	ШаблонСекция1 = "<p> </p><p><strong>%1 </strong></p>
	|<table><tbody><tr><td><p>Организация:</p></td><td><p>%2</p></td></tr>
	|<tr><td><p>На счет доверительного управления:</p></td><td><p>%3</p></td></tr>
	|<tr><td><p>Дата установки настроек:</p></td><td><p>%4</p></td></tr>
	|<tr><td><p>Со счета доверительного управления:</p></td><td><p>%5</p></td></tr>
	|<tr><td><p>Дата настроек:</p></td><td><p>%6</p></td></tr>
	|<tr><td><p>Ответственный:</p></td><td><p>%7</p></td></tr></tbody></table><p></p>";
	
	Если АвтоматическийРежим И ПустаяСтрока(ТекстОшибки) Тогда
		Заголовок = "Создан новый счет доверительного управления и выполнено копирование настроек учета:"; 
	ИначеЕсли АвтоматическийРежим И НЕ ПустаяСтрока(ТекстОшибки) Тогда
		Заголовок = "Создан новый счет доверительного управления:"; 
	ИначеЕсли НЕ АвтоматическийРежим И ПустаяСтрока(ТекстОшибки) Тогда 
		Заголовок = "Выполнено копирование настроек учета:";
		// ИначеЕсли НЕ АвтоматическийРежим И НЕ ПустаяСтрока(ТекстОшибки) Тогда 
		// Этого режима не будет. Ошибка будет показана в интерактивном режиме
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправленияКуда) Тогда 
		СсылкаСчетКуда = ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(ЭтотОбъект.СчетДоверительногоУправленияКуда); 
	Иначе
		СсылкаСчетКуда = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправленияОткуда) Тогда
		СсылкаСчетОткуда = ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(ЭтотОбъект.СчетДоверительногоУправленияОткуда); 
	Иначе
		СсылкаСчетОткуда = "";
	КонецЕсли;
	
	ОтчетОНастройкахПереноса = ОтчетОНастройкахПереноса + 
	СтрШаблон(ШаблонСекция1, Заголовок, ЭтотОбъект.Организация, 
	СсылкаСчетКуда,
	Формат(ЭтотОбъект.ДатаУстановки, "ДФ=dd.MM.yyyy"),
	СсылкаСчетОткуда,
	Формат(ЭтотОбъект.ДатаВзятия, "ДФ=dd.MM.yyyy"),
	РаботаСПользователями.ТекущийПользователь()); 
	
	ШаблонСекция2 = "<p> </p>
	|<p><strong>Перенесены следующие настройки </strong></p><p> </p>
	|<table><tbody><tr><td><p></p></td><td><p><strong>Общие настройки</strong></p></td></tr>
	|<tr><td><p>%1</p></td><td><p>Общие</p></td></tr>
	|<tr><td><p></p></td><td><p><strong>По виду учета</strong></p></td></tr>
	|<tr><td><p>%2</p></td><td><p>ЕПС</p></td></tr>
	|<tr><td><p>%3</p></td><td><p>БУ</p></td></tr>
	|<tr><td><p>%4</p></td><td><p>НУ</p></td></tr>
	|<tr><td><p></p></td><td><p><strong>Регистры:</strong></p></td></tr>
	|<tr><td><p>%5</p></td><td><p>Активы</p></td></tr>
	|<tr><td><p>%6</p></td><td><p>Активы по срочности</p></td></tr>
	|<tr><td><p>%7</p></td><td><p>Переопределение классификации учетных активов ЦБ</p></td></tr>
	|<tr><td><p>%8</p></td><td><p>Закрытия счетов</p></td></tr>
	|<tr><td><p>%9</p></td><td><p>Комиссия</p></td></tr></tbody></table><p></p>"; 
	
	ОтчетОНастройкахПереноса = ОтчетОНастройкахПереноса + 
	СтрШаблон(ШаблонСекция2,
	?(НастройкиПереноса.Общие, Символ(10004), ""),
	?(НастройкиПереноса.ПоВидуЕПС, Символ(10004), ""),
	?(НастройкиПереноса.ПоВидуБУ, Символ(10004), ""),
	?(НастройкиПереноса.ПоВидуНУ, Символ(10004), ""),
	?(НастройкиПереноса.Активы, Символ(10004), ""),
	?(НастройкиПереноса.АктивыПоСрочности, Символ(10004), ""),
	?(НастройкиПереноса.ПереопределениеКлассификации, Символ(10004), ""),
	?(НастройкиПереноса.ЗакрытияСчетов, Символ(10004), ""),
	?(НастройкиПереноса.Комиссия, Символ(10004), ""));//       
	
	
	ВидДоговораКуда = ЭтотОбъект.СчетДоверительногоУправленияКуда.ВидДоговораДоверительногоУправления;
	ВидДоговораОткуда = ЭтотОбъект.СчетДоверительногоУправленияОткуда.ВидДоговораДоверительногоУправления;
	Если (ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами 
		ИЛИ ВидДоговораКуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		И ВидДоговораОткуда = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда
		
		ОтчетОНастройкахПереноса = ОтчетОНастройкахПереноса + 
		"<p><font color = ""red"">Внимание! Настройки по налогову учету необходимо заполнить самостоятельно.</font></p>"; 
	КонецЕсли;

	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда		
		ОтчетОНастройкахПереноса = ОтчетОНастройкахПереноса +  "<p> </p>
		|<p><strong>При переносе настроек возникли следующие ошибки: </strong></p><p> </p>
		|<p>"+ ТекстОшибки + "</p>";
	КонецЕсли;
	
	
	ОтчетОНастройкахПереноса = ОтчетОНастройкахПереноса + "</body></html>";
	
	Возврат ОтчетОНастройкахПереноса;
	
КонецФункции

Процедура ОтправитьОповещение(ОтчетОПереносе, НастройкиПереноса, АвтоматическийРежим, ТекстОшибки) Экспорт 
	
	ТекстОповещения = СформироватьОтчетОНастройкахПереносаHtml(НастройкиПереноса, АвтоматическийРежим, ТекстОшибки);
	
	РеквизитыОповещения = Новый Структура("Организация, Текст", ЭтотОбъект.Организация, ТекстОповещения);
	
	ЕстьВложение = Ложь;
	Если ОтчетОПереносе.ВысотаТаблицы > 0 Тогда 
		
		Вложения = Новый Соответствие;
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
		ОтчетОПереносе.Записать(ИмяВременногоФайла,  ТипФайлаТабличногоДокумента.XLSX);
		
		Вложения.Вставить("Отчет о переносе настроек.xlsx", Новый Файл(ИмяВременногоФайла));
		
		РеквизитыОповещения.Вставить("Вложения", Вложения);
		
		ЕстьВложение = Истина;
	КонецЕсли; 
	
	Справочники.Оповещения.СформироватьОповещения("Обработка.КопированиеНастроекСчетаДоверительногоУправления", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	
	Если ЕстьВложение Тогда
		УдалитьФайлы(ИмяВременногоФайла); 
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти
